Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel.FrameWidth Property
 The width of the grid label frame.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double FrameWidth { get; }
Public ReadOnly Property FrameWidth As Double
	Get
Property Value
Type: Double
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace